-- Лабораторна робота №5 - Аналіз та оптимізація
-- База даних: hot_sauce_shop

USE hot_sauce_shop;

-- ========================================
-- Крок 1. Аналіз ДО створення індексу
-- ========================================

-- Аналізуємо запит пошуку за ціною БЕЗ індексу
EXPLAIN SELECT * FROM products WHERE price = 250.00;



-- ========================================
-- Крок 2. Створення індексу
-- ========================================

-- Створюємо індекс для колонки ціни
CREATE INDEX idx_products_price ON products (price);


-- ========================================
-- Крок 3. Аналіз ПІСЛЯ створення індексу
-- ========================================

-- Аналізуємо той самий запит ПІСЛЯ створення індексу
EXPLAIN SELECT * FROM products WHERE price = 250.00;

